backend-v2/tests/load/load-test.yml
config:
  target: http://localhost:5002
  phases:
    - duration: 60
      arrivalRate: 10
      name: Warm up
    - duration: 120
      arrivalRate: 50
      rampTo: 200
      name: Ramp up
    - duration: 300
      arrivalRate: 200
      name: Sustained load
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 200
      - http.response_time.p99: 500
    conditions:
      - expression: http.request_rate > 100
scenarios:
  - name: Health Check
    weight: 20
    flow:
      - get:
          url: /health
  - name: List Products
    weight: 50
    flow:
      - get:
          url: /api/products
  - name: List Categories
    weight: 30
    flow:
      - get:
          url: /api/categories